# Group by

In [1]:
import pandas as pd

In [3]:
df_1 = pd.DataFrame({
    "Name":["a", "b", "c", "d", "a", "b", "a", "b", "a", "c", "c"],
    "S_1": [12, 13, 14, 12, 13, 14, 15, 23, 25, 16, 10],
    "S_2" : [23, 24, 25, 26, 27, 28, 29, 30, 25, 34, 35]
})

df_1

   Name  S_1  S_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   34
10    c   10   35

In [5]:
df_2 = df_1.groupby("Name")
print(type(df_2))
for x, y in df_2:
    print(x)
    print(y)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
a
  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25
b
  Name  S_1  S_2
1    b   13   24
5    b   14   28
7    b   23   30
c
   Name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35
d
  Name  S_1  S_2
3    d   12   26

In [6]:
df_2.get_group("a")

  Name  S_1  S_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

In [7]:
df_2.min()

      S_1  S_2
Name
a      12   23
b      13   24
c      10   25
d      12   26

In [8]:
df_2.max()

      S_1  S_2
Name
a      25   29
b      23   30
c      16   35
d      12   26

In [9]:
list(df_2)

[('a',
    Name  S_1  S_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    Name  S_1  S_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
     Name  S_1  S_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
    Name  S_1  S_2
  3    d   12   26)]